In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("https://barrytheanalyst.eu/datasets/ufo_reports.csv")

In [3]:
df.head()

                   City Colors Reported Shape Reported State              Time
0                Ithaca             NaN       TRIANGLE    NY  06/01/1930 22:00
1           Willingboro             NaN          OTHER    NJ   6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO   2/15/1931 14:00
3               Abilene             NaN           DISK    KS  06/01/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY   4/18/1933 19:00

In [4]:
type(df)

pandas.core.frame.DataFrame

In [7]:
ds=df['City']
ds

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [8]:
type(ds)

pandas.core.series.Series

In [9]:
ds1=df.State
ds1

0        NY
1        NJ
2        CO
3        KS
4        NY
         ..
18236    IL
18237    IA
18238    WI
18239    WI
18240    FL
Name: State, Length: 18241, dtype: object

In [10]:
type(ds1)

pandas.core.series.Series

In [13]:
df['City and State']=df.City + '/ ' + df.State

In [14]:
df

,City,Colors Reported,Shape Reported,State,Time,City and State
0,Ithaca,NaN,TRIANGLE,NY,06/01/1930 22:00,Ithaca/ NY
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,Willingboro/ NJ
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,Holyoke/ CO
3,Abilene,NaN,DISK,KS,06/01/1931 13:00,Abilene/ KS
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,New York Worlds Fair/ NY
...,...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00,Grant Park/ IL
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00,Spirit Lake/ IA
18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45,Eagle River/ WI
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45,Eagle River/ WI
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59,Ybor/ FL

In [15]:
df.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time',
       'City and State'],
      dtype='object')

In [19]:
df.rename(columns={'Colors Reported':'Colors', 'Shape Reported':'Shapes'}, inplace=True)
df.columns

Index(['City', 'Colors', 'Shapes', 'State', 'Time', 'City and State'], dtype='object')

In [21]:
df_cols=['city','colors','shapes','state','time','city_state']
df.columns=df_cols
df.columns

Index(['city', 'colors', 'shapes', 'state', 'time', 'city_state'], dtype='object')

In [22]:
df_cols1=['city1','colors1','shapes1','state1','time1']

In [25]:
df=pd.read_csv("https://barrytheanalyst.eu/datasets/ufo_reports.csv",names=df_cols1,header=0)

In [26]:
df

                      city1 colors1   shapes1 state1             time1
0                    Ithaca     NaN  TRIANGLE     NY  06/01/1930 22:00
1               Willingboro     NaN     OTHER     NJ   6/30/1930 20:00
2                   Holyoke     NaN      OVAL     CO   2/15/1931 14:00
3                   Abilene     NaN      DISK     KS  06/01/1931 13:00
4      New York Worlds Fair     NaN     LIGHT     NY   4/18/1933 19:00
...                     ...     ...       ...    ...               ...
18236            Grant Park     NaN  TRIANGLE     IL  12/31/2000 23:00
18237           Spirit Lake     NaN      DISK     IA  12/31/2000 23:00
18238           Eagle River     NaN       NaN     WI  12/31/2000 23:45
18239           Eagle River     RED     LIGHT     WI  12/31/2000 23:45
18240                  Ybor     NaN      OVAL     FL  12/31/2000 23:59

[18241 rows x 5 columns]

In [27]:
df.columns

Index(['city1', 'colors1', 'shapes1', 'state1', 'time1'], dtype='object')

In [28]:
df.columns=df.columns.str.replace('1','2')

In [29]:
df.columns

Index(['city2', 'colors2', 'shapes2', 'state2', 'time2'], dtype='object')